In [1]:
import datetime
import pandas as pd
from sqlalchemy import create_engine

### Extract CSVs into DataFrames

In [2]:
player_file = "Resources/player_data.csv"
player_data_df = pd.read_csv(player_file)
player_data_df.head()

,name,year_start,year_end,position,height,weight,birth_date,college
0,Alaa Abdelnaby,1991,1995,F-C,6-10,240.0,"June 24, 1968",Duke University
1,Zaid Abdul-Aziz,1969,1978,C-F,6-9,235.0,"April 7, 1946",Iowa State University
2,Kareem Abdul-Jabbar,1970,1989,C,7-2,225.0,"April 16, 1947","University of California, Los Angeles"
3,Mahmoud Abdul-Rauf,1991,2001,G,6-1,162.0,"March 9, 1969",Louisiana State University
4,Tariq Abdul-Wahad,1998,2003,F,6-6,223.0,"November 3, 1974",San Jose State University

### Transform player DataFrame

In [9]:
new_player_data_df = player_data_df[['name', 'birth_date', 'height']].copy()
new_player_data_df.columns = ['player_name', 'birth_date', 'height']
new_player_data_df['id'] = new_player_data_df.index
new_player_data_df['name_height']= new_player_data_df['player_name']+'_'+new_player_data_df['height']
new_player_data_df.head()

           player_name        birth_date height  id              name_height
0       Alaa Abdelnaby     June 24, 1968   6-10   0      Alaa Abdelnaby_6-10
1      Zaid Abdul-Aziz     April 7, 1946    6-9   1      Zaid Abdul-Aziz_6-9
2  Kareem Abdul-Jabbar    April 16, 1947    7-2   2  Kareem Abdul-Jabbar_7-2
3   Mahmoud Abdul-Rauf     March 9, 1969    6-1   3   Mahmoud Abdul-Rauf_6-1
4    Tariq Abdul-Wahad  November 3, 1974    6-6   4    Tariq Abdul-Wahad_6-6

In [10]:
df = new_player_data_df

In [11]:
df['birth_date'] = pd.to_datetime(df['birth_date'])

In [12]:
df.head()

           player_name birth_date height  id              name_height
0       Alaa Abdelnaby 1968-06-24   6-10   0      Alaa Abdelnaby_6-10
1      Zaid Abdul-Aziz 1946-04-07    6-9   1      Zaid Abdul-Aziz_6-9
2  Kareem Abdul-Jabbar 1947-04-16    7-2   2  Kareem Abdul-Jabbar_7-2
3   Mahmoud Abdul-Rauf 1969-03-09    6-1   3   Mahmoud Abdul-Rauf_6-1
4    Tariq Abdul-Wahad 1974-11-03    6-6   4    Tariq Abdul-Wahad_6-6

In [13]:
len(df)

4550

### Create database connection

In [14]:
rds_connection_string = "root:j9stuart@127.0.0.1/nba_players"
engine = create_engine(f'mysql://{rds_connection_string}')

In [15]:
# Confirm tables
engine.table_names()

['player_birth_date']

### Load DataFrames into database

In [16]:
df.to_sql(name='player_birth_date', con=engine, if_exists='append', index=False)